Guguitino/STM32N6-Audio-Low-Latency/Projects/GS/Src/audio_bm.c
/**
  ******************************************************************************
  * @file    audio_bm.c
  * @author  MCD Application Team
  * @version V2.0.0
  * @date    02-May-2025
  * @brief
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_hal.h"
#include "stm32n6570_discovery.h"
#include "stm32n6570_discovery_xspi.h"
#include "stm32n6570_discovery_audio.h"
#include "app_config.h"
#include "system_clock_config.h"
#include "misc_toolbox.h"
#ifdef APP_DVFS
#include "pm_dvfs.h"
#endif
#ifdef CPU_STATS
#include "cpu_stats.h"
#endif
#include "AudioCapture_ring_buff.h"
#include "preproc_dpu.h"                           /* Preprocessing includes  */
#include "postproc_dpu.h"                          /* Postprocessing includes */
#include "ai_dpu.h"                                /* AI includes             */
#include "test.h"
#include "audio_bm.h"

/* Private define ------------------------------------------------------------*/
#define AUDIO_ACQ_LEN     (CTRL_X_CUBE_AI_ACQ_LENGTH)
#define AUDIO_LLACQ_LEN (320)
#if (CTRL_X_CUBE_AI_SPECTROGRAM_COL_OVL > 0)
#define AUDIO_ACQ_OFFSET  ((CTRL_X_CUBE_AI_SPECTROGRAM_COL_OVL*2 -1)*CTRL_X_CUBE_AI_SPECTROGRAM_HOP_LENGTH+CTRL_X_CUBE_AI_SPECTROGRAM_WINDOW_LENGTH)
#else
#define AUDIO_ACQ_OFFSET  (CTRL_X_CUBE_AI_SPECTROGRAM_WINDOW_LENGTH-CTRL_X_CUBE_AI_SPECTROGRAM_HOP_LENGTH)
#endif
#define AUDIO_OUT_FIRST   (CTRL_X_CUBE_AI_SPECTROGRAM_COL_OVL*CTRL_X_CUBE_AI_SPECTROGRAM_HOP_LENGTH)

/* Private function prototypes -----------------------------------------------*/
static void IAC_Config(void);
static void MPU_Config(void);
static void Ext_Mem_Config(void);
static void Int_Mem_Config(void);
static void SleepClks_init(void);
static void Error_Handler(void);
static void Record_Init(void);
static void NPU_SettingsLog(void);

#ifdef CPU_STATS
static void printCpuStats(void);
#endif

#if (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)
static void initAudioPlayBack(AudioBM_play_back_t *ctx_ptr);
static void AudioPlayBack(AudioBM_play_back_t *ctx_ptr, int16_t *pData, \
                                                uint16_t nbSamples, uint32_t ring_size_buffer);
static float vumeter(int16_t * pAudioSmp,int nb_sample);
#endif

/* Private variables ---------------------------------------------------------*/
static bool AudioProcIsOn;

#ifdef APP_BARE_METAL
static AudioBM_acq_t  audio_acq_ctx;
static AudioBM_proc_t audio_proc_ctx;
static AudioBM_play_back_t audio_llplayback_ctx;
static uint8_t llacq_buf[AUDIO_ACQ_LEN * sizeof(int16_t)];
#endif
#if (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)
int16_t  playback_buf[PLAYBACK_BUFFER_SIZE] __NON_CACHEABLE;
int16_t  llplayback_buf[LLPLAYBACK_BUFFER_SIZE] __NON_CACHEABLE;
#endif

typedef struct
{
	uint32_t bufferSize;
	uint32_t readSampleIndex;
	uint32_t writeSampleIndex;
	uint32_t availableSamples;
}ring_buff_stats_t;

static ring_buff_stats_t ringBuffStatsBuf[2];

void printRingBuffStats(uint32_t Idx)
{
	fflush(stdout);
}

/**
  * @brief  Initializes the system according to the application
  *         system requirement.
  * @param  None
  * @retval None
  */
void init_bm(void)
{
  /* Power on ICACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_ICACTIVE_Msk;

  /* Set back system and CPU clock source to HSI */
  __HAL_RCC_CPUCLK_CONFIG(RCC_CPUCLKSOURCE_HSI);
  __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);

  HAL_Init();

  SystemClock_Config_Full();

#ifdef APP_DVFS
  pm_init_dvfs();
#endif
  /* Force fusing of the OTP when using a Nucleo/DK board only */
#if (defined(USE_STM32N6xx_NUCLEO) || defined(USE_STM32N6570_DK))
  fuse_vddio();
#endif

  MPU_Config();
  Int_Mem_Config();
  Ext_Mem_Config();
  NPU_Config();
  IAC_Config();
  SCB_EnableICache();
  SCB_EnableDCache();
  SleepClks_init(); /* configures for sleep */

  /* BSP inits */
  UART_Config();
  BSP_PB_Init(BUTTON_USER1, BUTTON_MODE_EXTI);
  BSP_PB_Init(BUTTON_TAMP, BUTTON_MODE_EXTI);
  BSP_LED_Init(LED_GREEN);
  BSP_LED_Init(LED_RED);

  /* configuration information on console */
  displaySystemSetting();

  /* by default processing is active */
  AudioProcIsOn = true;
}

bool audio_process_low_latency(AudioBM_acq_t * acq_ctx_ptr, AudioBM_play_back_t * llplayback_ctx_ptr, uint32_t audio_acq_len)
{
	if (audio_acq_len > LLPLAYBACK_BUFFER_SIZE)
	    audio_acq_len = LLPLAYBACK_BUFFER_SIZE;

	uint32_t idxMax = llplayback_ctx_ptr->ring_buff.nbSamples * llplayback_ctx_ptr->ring_buff.nbFrames;

    uint32_t latency_target_samples = audio_acq_len;
    // --- Contrôle de la latence ---
    if (llplayback_ctx_ptr->ring_buff.availableSamples > latency_target_samples)
    {
        // Trop de backlog → on saute en resynchronisant
        int32_t newRead = (int32_t)llplayback_ctx_ptr->ring_buff.writeSampleIndex
                          - (int32_t)latency_target_samples;

        if (newRead < 0) newRead += idxMax;

        llplayback_ctx_ptr->ring_buff.readSampleIndex  = (uint32_t)newRead;
        llplayback_ctx_ptr->ring_buff.availableSamples = latency_target_samples;
    }

    // --- Acquisition d’un bloc ---
    AudioCapture_ring_buff_consume(llacq_buf, &acq_ctx_ptr->ring_buff, audio_acq_len);

    // --- Playback direct ---
    AudioPlayBack(llplayback_ctx_ptr, (int16_t *)llacq_buf, audio_acq_len, LLPLAYBACK_BUFFER_SIZE);

    ringBuffStatsBuf[0].bufferSize = acq_ctx_ptr->ring_buff.nbSamples * acq_ctx_ptr->ring_buff.nbFrames;
	ringBuffStatsBuf[0].availableSamples = acq_ctx_ptr->ring_buff.availableSamples;
	ringBuffStatsBuf[0].readSampleIndex = acq_ctx_ptr->ring_buff.readSampleIndex;
	ringBuffStatsBuf[0].writeSampleIndex = acq_ctx_ptr->ring_buff.writeSampleIndex;

	ringBuffStatsBuf[1].bufferSize = llplayback_ctx_ptr->ring_buff.nbSamples * llplayback_ctx_ptr->ring_buff.nbFrames;
	ringBuffStatsBuf[1].availableSamples = llplayback_ctx_ptr->ring_buff.availableSamples;
	ringBuffStatsBuf[1].readSampleIndex = llplayback_ctx_ptr->ring_buff.readSampleIndex;
	ringBuffStatsBuf[1].writeSampleIndex = llplayback_ctx_ptr->ring_buff.writeSampleIndex;

    BSP_LED_Toggle(LED_GREEN);  // petit indicateur visuel

