Guguitino/STM32N6-Audio-Low-Latency/Projects/GS/Src/audio_bm.c
    return true;
}

#ifdef APP_BARE_METAL
/**
  * @brief  main loop for bare metal implementation.
  * @param  None
  * @retval None
  */
void exec_bm(void)
{
  bool cont = true;
  time_stats_init();

  initAudioProc(&audio_proc_ctx);
  initAudioCapture(&audio_acq_ctx);
  startAudioCapture(&audio_acq_ctx);
  printHeader();

  audio_llplayback_ctx.ring_buff.readSampleIndex  = 0 ;
  audio_llplayback_ctx.ring_buff.writeSampleIndex = 0 ;
  audio_llplayback_ctx.ring_buff.nbFrames = 1;
  audio_llplayback_ctx.ring_buff.nbBytesPerSample = 2;
  audio_llplayback_ctx.ring_buff.nbSamples = LLPLAYBACK_BUFFER_SIZE;
  audio_llplayback_ctx.ring_buff.pData = (uint8_t *)llplayback_buf;
  audio_llplayback_ctx.cnt = 0;

  while(cont)
  {
    __NOP(); /* to be resilient to gcc optim ... to investigate */
#ifdef  APP_LP
    HAL_SuspendTick();
    HAL_PWR_EnterSLEEPMode(0, PWR_SLEEPENTRY_WFI);
    HAL_ResumeTick();
#endif /* APP_LP */


    uint32_t audio_acq_len;
	if(AudioProcIsOn)
	{
		audio_acq_len = AUDIO_ACQ_LEN;
	}
	else
	{
		audio_acq_len = LLPLAYBACK_BUFFER_SIZE/4;
	}
    uint32_t availableSamples = audio_acq_ctx.ring_buff.availableSamples;
    if (availableSamples >= audio_acq_len)
    {
    	if(AudioProcIsOn)
		{
    		cont = audio_process(&audio_acq_ctx,&audio_proc_ctx, audio_acq_len);
		}
		else
		{
			cont = audio_process_low_latency(&audio_acq_ctx, &audio_llplayback_ctx, audio_acq_len);
		}
#ifdef CPU_STATS
        printCpuStats();
#endif
    }
  }
  stopAudioCapture();

#if (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)
  stopAudioPlayBack();
#endif

  test_dump();
  my_printf("\n\r# End Processing\n\r");
}
#endif
/**
 * @brief  Initializes all Audio processing
 * @param  proc_ctx_ptr pointer to processing context
 * @retval None
 */
void initAudioProc(AudioBM_proc_t * ctx_ptr)
{
  struct npu_model_info *pxInfo;
  /* init test facilities */
  test_init();
  /* get the AI model */
  AiDPULoadModel( &ctx_ptr->aiCtx, CTRL_X_CUBE_AI_MODEL_NAME );
  pxInfo     = &ctx_ptr->aiCtx.net_exec_ctx->info;
  ctx_ptr->ai_in_ptr = (int8_t *) LL_Buffer_addr_start(pxInfo->in_bufs[0]);
  ctx_ptr->ai_out_ptr = pxInfo->out_bufs[0] ;
  /* clear input samples array ( get silence on first overlayed patch */
  memset(ctx_ptr->proc_buff,0,PATCH_LENGTH*sizeof(int16_t));
  /* Audio Preprocessing init */
  PreProc_DPUInit(&ctx_ptr->audioPreCtx);
  /* Audio Postprocessing init */
  PostProc_DPUInit(&ctx_ptr->audioPostCtx);
  /* transfer quantization parametres included in AI model to the Audio DPU   */
  ctx_ptr->audioPreCtx.output_Q_offset    = ctx_ptr->aiCtx.input_Q_offset;
  ctx_ptr->audioPreCtx.output_Q_inv_scale =
            (PREPROC_FLOAT_T) ctx_ptr->aiCtx.input_Q_inv_scale;
  ctx_ptr->audioPreCtx.quant.output_Q_inv_scale = ctx_ptr->audioPreCtx.output_Q_inv_scale;
  ctx_ptr->audioPreCtx.quant.output_Q_offset = ctx_ptr->audioPreCtx.output_Q_offset;
  ctx_ptr->cnt = 0;
#if (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)
  initAudioPlayBack(&ctx_ptr->audioPlayBackCtx);
#endif
}

/**
  * @brief  audio processing - pre, main, and post
  * @param  acq_ctx_ptr pointer to acquisition context
  * @param  proc_ctx_ptr pointer to processing context
  * @retval true if continue condition is met
  */
bool audio_process(AudioBM_acq_t * acq_ctx_ptr,AudioBM_proc_t * proc_ctx_ptr, uint32_t audio_acq_len)
{

#if (CTRL_X_CUBE_AI_MODE_OUTPUT_1 == CTRL_AI_CLASS_DISTRIBUTION )
  bool isNotSilence, isPlayback;
#endif

  uint8_t *proc_buf = (uint8_t *) proc_ctx_ptr->proc_buff;
  uint8_t *proc_buf_ovl = (uint8_t *) (&proc_ctx_ptr->proc_buff[AUDIO_ACQ_LEN]);
  uint8_t *acq_buf = (uint8_t *) (&proc_ctx_ptr->proc_buff[AUDIO_ACQ_OFFSET]);
  bool cont = true;

#ifdef APP_DVFS
  pm_set_opp_min(OPP_MAX);
#endif /* APP_DVFS */

  /* prepare overlapping samples from previous patch */
  memcpy(proc_buf,proc_buf_ovl,AUDIO_ACQ_OFFSET*sizeof(int16_t));

  /* Audio samples acquisition */
  AudioCapture_ring_buff_consume(acq_buf,&acq_ctx_ptr->ring_buff,AUDIO_ACQ_LEN);
#ifdef APP_LP
  NPU_SRAM_on();
#endif /* APP_LP */

  /* Audio pre processing */
  PreProc_DPU(&proc_ctx_ptr->audioPreCtx, proc_buf, proc_ctx_ptr->ai_in_ptr );

#if (CTRL_X_CUBE_AI_MODE_OUTPUT_1 == CTRL_AI_CLASS_DISTRIBUTION )
  isNotSilence = (proc_ctx_ptr->audioPreCtx.S_Spectr.spectro_sum > CTRL_X_CUBE_AI_SPECTROGRAM_SILENCE_THR);
  isPlayback = test_probe_in(&proc_ctx_ptr->aiCtx,&proc_ctx_ptr->audioPreCtx);
#endif

#ifdef APP_LP
  NPU_on();
#endif /* APP_LP */
  /* AI processing */
  AiDPUProcess(&proc_ctx_ptr->aiCtx);

#if (CTRL_X_CUBE_AI_MODE_OUTPUT_1 == CTRL_AI_CLASS_DISTRIBUTION )
  if (isNotSilence || isPlayback) printInferenceResults(proc_ctx_ptr->ai_out_ptr);
#endif

#if (CTRL_X_CUBE_AI_POSTPROC==CTRL_AI_ISTFT)
  PostProc_DPU(&proc_ctx_ptr->audioPostCtx,
      proc_ctx_ptr->audioPreCtx.pCplxSpectrum,
      (float32_t *) LL_Buffer_addr_start(proc_ctx_ptr->ai_out_ptr),
      proc_ctx_ptr->audio_out);
#endif

#if (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)
  int16_t * audioPtr = (AudioProcIsOn) ?
      &proc_ctx_ptr->audio_out[AUDIO_OUT_FIRST] : (int16_t *)acq_buf ;
  AudioPlayBack(&proc_ctx_ptr->audioPlayBackCtx, audioPtr , AUDIO_ACQ_LEN, PLAYBACK_BUFFER_SIZE);
#endif

#ifdef APP_LP
  NPU_off();
#endif /* APP_LP */

#ifdef APP_DVFS 
  pm_set_opp_min(OPP_MIN);
#endif 
  ringBuffStatsBuf[0].bufferSize = acq_ctx_ptr->ring_buff.nbSamples * acq_ctx_ptr->ring_buff.nbFrames;
	ringBuffStatsBuf[0].availableSamples = acq_ctx_ptr->ring_buff.availableSamples;
	ringBuffStatsBuf[0].readSampleIndex = acq_ctx_ptr->ring_buff.readSampleIndex;
	ringBuffStatsBuf[0].writeSampleIndex = acq_ctx_ptr->ring_buff.writeSampleIndex;

	ringBuffStatsBuf[1].bufferSize = proc_ctx_ptr->audioPlayBackCtx.ring_buff.nbSamples * proc_ctx_ptr->audioPlayBackCtx.ring_buff.nbFrames;
	ringBuffStatsBuf[1].availableSamples = proc_ctx_ptr->audioPlayBackCtx.ring_buff.availableSamples;
	ringBuffStatsBuf[1].readSampleIndex = proc_ctx_ptr->audioPlayBackCtx.ring_buff.readSampleIndex;
	ringBuffStatsBuf[1].writeSampleIndex = proc_ctx_ptr->audioPlayBackCtx.ring_buff.writeSampleIndex;

  BSP_LED_Toggle(LED_GREEN);
  
  return cont;
}


/**
* @brief  Initializes Audio capture from microphone
* @param  acq_ctx_ptr pointer to acquisition context
* @retval None
*/
void initAudioCapture(AudioBM_acq_t *ctx_ptr)
{
  ctx_ptr->ring_buff.nbSamples = ((PATCH_LENGTH / CAPTURE_BUFFER_SIZE) + 1 ) \
                                                        * CAPTURE_BUFFER_SIZE ;
  ctx_ptr->ring_buff.nbBytesPerSample = 2;
  ctx_ptr->ring_buff.nbFrames = 2;
  AudioCapture_ring_buff_alloc(&ctx_ptr->ring_buff);
  /* Initialize record */
  Record_Init();
}

/**
* @brief  Starts Audio capture from microphone
* @param  acq_ctx_ptr pointer to acquisition context
* @retval None
*/
void startAudioCapture(AudioBM_acq_t * ctx_ptr)
{
  /* Start record */
  if (BSP_ERROR_NONE != BSP_AUDIO_IN_Record(1, (uint8_t *) ctx_ptr->acq_buf,
                                         CAPTURE_BUFFER_SIZE * sizeof(int16_t)))
  {
    Error_Handler();
  }
}

