Guguitino/STM32N6-Audio-Low-Latency/Projects/GS/Src/audio_bm.c
#if (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)
/**
* @brief  Stops Audio Playback
* @param  None
* @retval None
*/
void stopAudioPlayBack(void)
{
  BSP_AUDIO_OUT_Stop(1);
}
#endif

/**
* @brief  Stops Audio Capture
* @param  None
* @retval None
*/
void stopAudioCapture(void)
{
  BSP_AUDIO_IN_Stop(1);
}

#ifdef APP_LP

/**
* @brief  NPU (Neural Processing Unit) RAM power on.
* @param  None.
* @retval None.
*/
void NPU_SRAM_on(void)
{
  RAMCFG_HandleTypeDef hramcfg = {0};
  hramcfg.Instance =  RAMCFG_SRAM6_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  __HAL_RCC_AXISRAM6_MEM_CLK_ENABLE();
  __HAL_RCC_CACHEAXIRAM_MEM_CLK_ENABLE();
}

/**
* @brief  NPU (Neural Processing Unit) power ram off.
* @param  None.
* @retval None.
*/
void NPU_SRAM_off(void)
{
  RAMCFG_HandleTypeDef hramcfg = {0};
  hramcfg.Instance =  RAMCFG_SRAM6_AXI;
  HAL_RAMCFG_DisableAXISRAM(&hramcfg);
  __HAL_RCC_AXISRAM6_MEM_CLK_DISABLE();
  __HAL_RCC_CACHEAXIRAM_MEM_CLK_DISABLE();
}

/**
* @brief  NPU (Neural Processing Unit) power on.
* @param  None.
* @retval None.
*/
void NPU_on(void)
{
  NPU_SRAM_on();
  NPU_Config();
  __HAL_RCC_XSPI2_CLK_ENABLE();
}

/**
* @brief  NPU (Neural Processing Unit) power off.
* @param  None.
* @retval None.
*/
void NPU_off(void)
{
  __HAL_RCC_NPU_CLK_DISABLE();
  __HAL_RCC_CACHEAXI_CLK_DISABLE();
  NPU_SRAM_off();
  __HAL_RCC_XSPI2_CLK_DISABLE();
}

#endif /* APP_LP */

#ifdef APP_DVFS
/**
  * @brief Initialize the UART MSP.
  * @param huart UART handle.
  * @retval None
  */
void HAL_UART_MspInit(UART_HandleTypeDef *huart)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(huart);

  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.MSIState       = RCC_MSI_ON;
  RCC_OscInitStruct.MSIFrequency   = RCC_MSI_FREQ_4MHZ;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    /* Initialization Error */
    while(1);
  }

  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};
  /*  Select MSI for UART */
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1;
  PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_MSI;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
  __BKPT(0);
  }
}
#endif /* APP_DVFS */

void printHeader(void)
{
	my_printf(SEPARATION_LINE);
	my_printf("# Start Processing\n\r");
	my_printf(SEPARATION_LINE);

#if (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)
	my_printf("| Vu meter          ");
#else
	my_printf("                    ");
#endif
#ifdef CPU_STATS
	my_printf("| Frame   |  Cpu  |  Pre |  AI  | Post |");
#endif
	my_printf("\r\n");
}

#ifdef CPU_STATS
void printCpuStats(void)
{
	/* display real time statistics */
	float pre_load = 100 * time_stats_get_avg(TIME_STAT_PRE_PROC)/CTRL_X_CUBE_AI_ACQ_LENGTH_MS;
	float ai_load = 100 * time_stats_get_avg(TIME_STAT_AI_PROC)/CTRL_X_CUBE_AI_ACQ_LENGTH_MS;
	float post_load = 100 * time_stats_get_avg(TIME_STAT_POST_PROC)/CTRL_X_CUBE_AI_ACQ_LENGTH_MS;
#if (CTRL_X_CUBE_AI_AUDIO_OUT!=COM_TYPE_HEADSET)
	my_printf("                    ");
#endif
	printf ("| %-8d|%6.2f%%|%6.2f|%6.2f|%6.2f|\r\n",time_stats_get_cnt(TIME_STAT_AI_PROC),pre_load+ai_load+post_load,pre_load, ai_load, post_load);

	printf ("|Acq ring buffer    | %d| %d| %d| %d|\r\n", ringBuffStatsBuf[0].bufferSize, \
			ringBuffStatsBuf[0].availableSamples, ringBuffStatsBuf[0].readSampleIndex, \
			ringBuffStatsBuf[0].writeSampleIndex);
	printf ("|PlayBack ring buff | %d| %d| %d| %d|\r\n\n", ringBuffStatsBuf[1].bufferSize, \
				ringBuffStatsBuf[1].availableSamples, ringBuffStatsBuf[1].readSampleIndex, \
				ringBuffStatsBuf[1].writeSampleIndex);

	fflush(stdout);
}
#endif

#if (CTRL_X_CUBE_AI_MODE_OUTPUT_1 == CTRL_AI_CLASS_DISTRIBUTION )
/**
* @brief  Displays Inference processing outputs
* @param  None
* @retval None
*/
void printInferenceResults(const LL_Buffer_InfoTypeDef* pBuffRes)
{
  /**
  * Specifies the labels for the classes of the demo.
  */

  const char* sAiClassLabels[CTRL_X_CUBE_AI_MODE_CLASS_NUMBER] \
  = CTRL_X_CUBE_AI_MODE_CLASS_LIST;
  float *nn_out =  (float *) LL_Buffer_addr_start(pBuffRes);

  uint32_t nn_out_len = get_ll_buffer_size(pBuffRes)/sizeof(float);
  float max_out = nn_out[0];
  uint32_t max_idx = 0;
  for(uint32_t i = 1; i < nn_out_len; i++)
  {
    if(nn_out[i] > max_out)
    {
      max_idx = i;
      max_out = nn_out[i];
    }
  }
#ifdef CPU_STATS
   my_printf("\r\n");
#endif

  if (max_out > CTRL_X_CUBE_AI_OOD_THR )
  {
    my_printf("{\"class\":\"%s\"}",sAiClassLabels[max_idx]);
  }
  else
  {
    my_printf("{\"class\":\"%s\"}","unknown");
  }
  my_printf("\r\n");

}

#endif

/**
* @brief  Displays System Settings
* @param  None
* @retval None
*/
void displaySystemSetting(void)
{
  my_printf("\n\r");
  my_printf(SEPARATION_LINE);
  my_printf("        System configuration (%s)\n\r",APP_CONF_STR);
  my_printf(SEPARATION_LINE);
  printf("\n\rLog Level: %s\n\n\r", getLogLevelStr(LOG_LEVEL));
  systemSettingLog();
  NPU_SettingsLog();
#if defined (APP_DVFS) || defined (APP_LP)
  my_printf("\r\nLow Power Options:");
#ifdef APP_LP
  my_printf("\r\n DPS");
#endif /* APP_LP */
#ifdef APP_DVFS  
  my_printf("\r\n DFVS");
#endif /* APP_DFVS */
  my_printf("\r\n");
#endif /* APP_DVFS || APP_LP */
}

void toggle_audio_proc(void)
{
  BSP_LED_Toggle(LED_RED);
  AudioProcIsOn = !AudioProcIsOn;
}

/**
* @brief  Manages the BSP audio half transfer.
* @param  pHdle pointer to audio ring buffer handle
* @param  pData pointer to audio acquired samples buffer
* @param  half_buf id ( 0 or 1 )
* @retval None.
*/
void AudioCapture_half_buf_cb(AudioCapture_ring_buff_t *pHdle, int16_t *pData, uint8_t half_buf)
{
  int16_t *in_p = pData + half_buf * (CAPTURE_BUFFER_SIZE/ 2);
  AudioCapture_ring_buff_feed(pHdle, (uint8_t *)in_p, CAPTURE_BUFFER_SIZE/ 2);
}

#ifdef APP_BARE_METAL
/**
* @brief  Manage the BSP audio in transfer complete event.
* @param  Instance Audio in instance.
* @retval None.
*/
void BSP_AUDIO_IN_TransferComplete_CallBack(uint32_t Instance)
{
  if (Instance == 1U)
  {
    AudioCapture_half_buf_cb(&audio_acq_ctx.ring_buff, audio_acq_ctx.acq_buf, 1U);
  }
}

/**
* @brief  Manage the BSP audio in half transfer complete event.
* @param  Instance Audio in instance.
* @retval None.
*/
void BSP_AUDIO_IN_HalfTransfer_CallBack(uint32_t Instance)
{
  if (Instance == 1U)
  {
    AudioCapture_half_buf_cb(&audio_acq_ctx.ring_buff, audio_acq_ctx.acq_buf, 0U);
  }
}
#if (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)
/**
  * @brief  Tx Transfer completed callbacks.
  * @param  None.
  * @retval None.
  */
void BSP_AUDIO_OUT_TransferComplete_CallBack(uint32_t Instance)
{
	if (AudioProcIsOn)
	{
		AudioCapture_ring_buff_consume_no_cpy(&audio_proc_ctx.audioPlayBackCtx.ring_buff, PLAYBACK_BUFFER_SIZE/2);
	}
	else
	{
		AudioCapture_ring_buff_consume_no_cpy(&audio_llplayback_ctx.ring_buff, LLPLAYBACK_BUFFER_SIZE/2);
	}
}

/**
  * @brief  Tx Transfer Half completed callbacks
  * @param  None.
  * @retval None.
  */
void BSP_AUDIO_OUT_HalfTransfer_CallBack(uint32_t Instance)
{
	if (AudioProcIsOn)
	{
		AudioCapture_ring_buff_consume_no_cpy(&audio_proc_ctx.audioPlayBackCtx.ring_buff, PLAYBACK_BUFFER_SIZE/2);
	}
	else
	{
		AudioCapture_ring_buff_consume_no_cpy(&audio_llplayback_ctx.ring_buff, LLPLAYBACK_BUFFER_SIZE/2);
	}

