Guguitino/STM32N6-Audio-Low-Latency/Projects/GS/Src/audio_bm.c
}
#endif /* (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)  */

/**
* @brief  Manages the BSP audio in error event.
* @param  Instance Audio in instance.
* @retval None.
*/
void BSP_AUDIO_IN_Error_CallBack(uint32_t Instance)
{
  Error_Handler();
}

void BSP_PB_Callback(Button_TypeDef Button)
{
  if (BUTTON_USER1 == Button)
  {

  audio_llplayback_ctx.cnt = 0;
	audio_proc_ctx.audioPlayBackCtx.cnt = 0;

	BSP_AUDIO_OUT_Stop(0);
	BSP_AUDIO_OUT_Stop(1);
	AudioCapture_ring_buff_consume_no_cpy(&audio_llplayback_ctx.ring_buff, LLPLAYBACK_BUFFER_SIZE/2);
	AudioCapture_ring_buff_consume_no_cpy(&audio_proc_ctx.audioPlayBackCtx.ring_buff, PLAYBACK_BUFFER_SIZE/2);

	toggle_audio_proc();
  }
}
#endif

/*==============================================================================
                    private  functions definition
 ============================================================================= */

#if (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)
/**
  * @brief  Playback initialization
  * @param  ctx_ptr play back execution context
  * @retval None
  */
static void initAudioPlayBack(AudioBM_play_back_t *ctx_ptr)
{
   BSP_AUDIO_Init_t AudioInit;

  /* Configure playback */
  AudioInit.Device        = AUDIO_OUT_DEVICE_HEADPHONE;
  AudioInit.SampleRate    = AUDIO_FREQUENCY;
  AudioInit.BitsPerSample = AUDIO_RESOLUTION_16B;
  AudioInit.ChannelsNbr   = 1;
  AudioInit.Volume        = 0; /* not used */

  if (BSP_ERROR_NONE != BSP_AUDIO_OUT_Init(0, &AudioInit))
  {
    Error_Handler();
  }
  ctx_ptr->ring_buff.readSampleIndex  = 0 ;
  ctx_ptr->ring_buff.writeSampleIndex = 0 ;
  ctx_ptr->ring_buff.nbFrames = 1;
  ctx_ptr->ring_buff.nbBytesPerSample = 2;
  ctx_ptr->ring_buff.nbSamples = PLAYBACK_BUFFER_SIZE;
  ctx_ptr->ring_buff.pData = (uint8_t *) playback_buf;
  ctx_ptr->cnt = 0 ;

  audio_llplayback_ctx.ring_buff.readSampleIndex  = 0 ;
  audio_llplayback_ctx.ring_buff.writeSampleIndex = 0 ;
  audio_llplayback_ctx.ring_buff.nbFrames = 1;
  audio_llplayback_ctx.ring_buff.nbBytesPerSample = 2;
  audio_llplayback_ctx.ring_buff.nbSamples = LLPLAYBACK_BUFFER_SIZE;
  audio_llplayback_ctx.ring_buff.pData = (uint8_t *)llplayback_buf;
  audio_llplayback_ctx.cnt = 0;
}

static void AudioPlayBack(AudioBM_play_back_t *ctx_ptr, int16_t *pData, \
    uint16_t nbSamples, uint32_t ring_buffer_size)
{
	printf("APB: cnt=%d avail=%d\n", ctx_ptr->cnt, ctx_ptr->ring_buff.availableSamples);

  float lev_db = vumeter((int16_t *)pData,nbSamples);
  if (lev_db < CTRL_X_CUBE_AI_AUDIO_OUT_DB_THRESHOLD)
  {
    for (int i=0; i<nbSamples; i++){
      pData[i] = 0;
    }
  }
  AudioCapture_ring_buff_feed(& ctx_ptr->ring_buff,(uint8_t *) pData, nbSamples);

  if (ctx_ptr->cnt== 1) 
  {
    /* Start the playback */
	uint32_t bsp_error = BSP_AUDIO_OUT_Play(0, ctx_ptr->ring_buff.pData, ring_buffer_size * sizeof(int16_t));
    if (BSP_ERROR_NONE != bsp_error)
    {
      Error_Handler();
    }
  }
  ctx_ptr->cnt++;
}

/**
 * @brief  Displays level of audio on the console in the from of a colored bar
 * @param  IN pAudioSmp : pointer to audio samples
 * @param  IN nb_samples : number of samples
 * @retval audio level in dB
 */
static float vumeter(int16_t * pAudioSmp,int nb_samples)
{
	float sum=0 ;
	for (int i = 0 ; i < nb_samples ; i ++)
	{
		sum += pAudioSmp[i]*pAudioSmp[i];
	}
	// Float value here corresponds to log10(2**30)
	float lev_db = (float)(10*(log10(sum/(nb_samples)) - 9.03089986F));
	// Casting it back to int and removing scale factor for display
	int lev = (int) (lev_db + 10 * 9.03089986F) / 5;
  lev=(lev<0)? 0 : lev;
  lev=(lev>20)? 20 : lev;
	printf("\r\033[42m");
	for (int i = 0 ; i < lev && i < 6 ; i ++)
	{
		printf(" ");
	}
	printf("\033[43m");
	for (int i = 6 ; i < lev && i < 12 ; i ++)
	{
		printf(" ");
	}
	printf("\033[41m");
	for (int i = 12 ; i < lev ; i ++)
	{
		printf(" ");
	}
	printf("\033[0m");
	for (int i = 0 ; i < 20 - lev ; i ++)
	{
		printf(" ");
	}
	fflush(stdout);
	return lev_db;
}

#endif

static void Int_Mem_Config(void)
{
  RAMCFG_HandleTypeDef hramcfg = {0};

  __HAL_RCC_SYSCFG_CLK_ENABLE();
  __HAL_RCC_CRC_CLK_ENABLE();

#ifdef APP_LP
/*  hramcfg.Instance =  RAMCFG_SRAM2_AXI;
  HAL_RAMCFG_DisableAXISRAM(&hramcfg);
  HAL_RAMCFG_EnableAXISRAM(&hramcfg); */
  hramcfg.Instance =  RAMCFG_SRAM6_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);

  __HAL_RCC_CACHEAXIRAM_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM6_MEM_CLK_ENABLE();

/*  __HAL_RCC_AXISRAM2_MEM_CLK_DISABLE(); */
  __HAL_RCC_AHBSRAM1_MEM_CLK_DISABLE();
  __HAL_RCC_AHBSRAM2_MEM_CLK_DISABLE();
  __HAL_RCC_BKPSRAM_MEM_CLK_DISABLE();

#else /* APP_LP */

  RCC->MEMENR |= RCC_MEMENR_AXISRAM3EN | RCC_MEMENR_AXISRAM4EN | RCC_MEMENR_AXISRAM5EN | RCC_MEMENR_AXISRAM6EN;
  RCC->MEMENR |= RCC_MEMENR_CACHEAXIRAMEN; 
  hramcfg.Instance =  RAMCFG_SRAM2_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM3_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM4_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM5_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM6_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);

  __HAL_RCC_CACHEAXIRAM_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM2_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM3_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM4_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM5_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM6_MEM_CLK_ENABLE();

#endif 
  /* Allow caches to be activated. Default value is 1, but the current boot sets it to 0 */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_DCACTIVE_Msk | MEMSYSCTL_MSCR_ICACTIVE_Msk;
}

/**
* @brief  Record initialization
* @param  None
* @retval None
*/
static void Record_Init(void)
{
  BSP_AUDIO_Init_t AudioInit;
  uint32_t         GetData;

  /* Test of state */
  if (BSP_ERROR_NONE != BSP_AUDIO_IN_GetState(1, &GetData)) Error_Handler();
  if (GetData != AUDIO_IN_STATE_RESET) Error_Handler();

  AudioInit.Device        = AUDIO_IN_DEVICE_DIGITAL_MIC;
  AudioInit.SampleRate    = AUDIO_FREQUENCY;
  AudioInit.BitsPerSample = AUDIO_RESOLUTION_16B;
  AudioInit.ChannelsNbr   = 1;
  AudioInit.Volume        = 80; /* Not used */

  if (BSP_ERROR_NONE != BSP_AUDIO_IN_Init(1, &AudioInit))
  {
    Error_Handler();
  }

  /* Test of state */
  if (BSP_ERROR_NONE != BSP_AUDIO_IN_GetState(1, &GetData)) Error_Handler();
  if (GetData != AUDIO_IN_STATE_STOP) Error_Handler();

  /* Test set and get functions */
  if (BSP_ERROR_FEATURE_NOT_SUPPORTED != BSP_AUDIO_IN_SetVolume(1, 10)) Error_Handler();
  /*if (BSP_ERROR_NONE != BSP_AUDIO_IN_SetSampleRate(1, SAI_AUDIO_FREQUENCY_96K)) Error_Handler(); */
  if (BSP_ERROR_NONE != BSP_AUDIO_IN_SetDevice(1, AUDIO_IN_DEVICE_ANALOG_MIC)) Error_Handler();
  if (BSP_ERROR_FEATURE_NOT_SUPPORTED != BSP_AUDIO_IN_SetBitsPerSample(1, AUDIO_RESOLUTION_8B)) Error_Handler();
  if (BSP_ERROR_NONE != BSP_AUDIO_IN_SetBitsPerSample(1, AUDIO_RESOLUTION_16B)) Error_Handler();
  if (BSP_ERROR_FEATURE_NOT_SUPPORTED != BSP_AUDIO_IN_SetBitsPerSample(1, AUDIO_RESOLUTION_24B)) Error_Handler();
  if (BSP_ERROR_FEATURE_NOT_SUPPORTED != BSP_AUDIO_IN_SetBitsPerSample(1, AUDIO_RESOLUTION_32B)) Error_Handler();
  if (BSP_ERROR_FEATURE_NOT_SUPPORTED != BSP_AUDIO_IN_SetChannelsNbr(1, 2)) Error_Handler();
  if (BSP_ERROR_NONE != BSP_AUDIO_IN_SetChannelsNbr(1, 1)) Error_Handler();

  if (BSP_ERROR_FEATURE_NOT_SUPPORTED != BSP_AUDIO_IN_GetVolume(1, &GetData)) Error_Handler();
  if (BSP_ERROR_NONE != BSP_AUDIO_IN_GetSampleRate(1, &GetData)) Error_Handler();
  /*if (GetData != AUDIO_FREQUENCY_96K) Error_Handler();*/
  if (BSP_ERROR_NONE != BSP_AUDIO_IN_GetDevice(1, &GetData)) Error_Handler();
  if (GetData != AUDIO_IN_DEVICE_DIGITAL_MIC) Error_Handler();
  if (BSP_ERROR_NONE != BSP_AUDIO_IN_GetBitsPerSample(1, &GetData)) Error_Handler();
  if (GetData != AUDIO_RESOLUTION_16B) Error_Handler();
  if (BSP_ERROR_NONE != BSP_AUDIO_IN_GetChannelsNbr(1, &GetData)) Error_Handler();
  if (GetData != 1U) Error_Handler();

  /* Set the initial sample rate */
  if (BSP_ERROR_NONE != BSP_AUDIO_IN_SetSampleRate(1, AudioInit.SampleRate)) Error_Handler();
}

